### Списки:

#1. **Робота із списками:**
#   Завдання: Створіть список чисел. Додайте до списку числа 10 і 20, видаліть число 10 і виведіть отриманий список.

my_list = [10, 20]

my_list = my_list.pop()
print(my_list)

#2. **Знаходження суми:**
#   Завдання: Створіть список чисел. Знайдіть та виведіть суму всіх чисел у списку.

my_list = [1, 2, 3, 4, 5]
print(sum(my_list))

#3. **Подвійні значення:**
#   Завдання: Створіть список чисел. Подвойте кожне число у списку та виведіть результат.

my_list = [1, 2, 3, 4, 5]

print(my_list * 2)

### Кортежі:

#1. **Робота із кортежами:**
#   Завдання: Створіть кортеж з трьох різних предметів, таких як ("яблуко", "банан", "апельсин"). Виведіть кожен елемент кортежу окремо.

my_tuple = ("apple", "banana", "orange")

for element in my_tuple:
    print(element)

#2. **Об'єднання кортежів:**
#   Завдання: Створіть два кортежі з числами і об'єднайте їх у новий кортеж. Виведіть отриманий кортеж.

my_tuple_1 = (1, 2, 3, 4, 5)
my_tuple_2 = (6, 7, 8, 9, 10)

my_tuple_new = my_tuple_1 + my_tuple_2

print(my_tuple_new)

### Словники:

#1. **Робота із словниками:**
#   Завдання: Створіть словник, що містить інформацію про вашого улюбленого спортсмена (ім'я, вік, спорт, команда тощо). Виведіть цю інформацію на екран.

my_dct = {'Name':'Mychailo', 'Last Name':'Mudryk', 'age':22, 'Sport':'Football', 'Team':'Chelsea'}
print(my_dct)

#2. **Оновлення словника:**
#   Завдання: Створіть словник, що містить ваші улюблені книги (назва книги та рік видання). Додайте до словника нову улюблену книгу та виведіть оновлений словник.

books = {'А зорі тут тихі':2010, 'А нумо знову віршувать':2011, 'А тепер зачекайте до минулого року':2009, 'А ще ми вигулюємо собак':2012}
books.update({'2061: Одіссея Три':2011, '2084: Кінець світу':2012})
print(books)

#3. **Пошук значення:**
#   Завдання: Створіть словник, що містить інформацію про країни та їх столиці. Запитайте користувача про назву країни і виведіть столицю цієї країни (якщо така країна є у словнику).

countries_capitals = {
    "Україна": "Київ",
    "Франція": "Париж",
    "Італія": "Рим",
    "Німеччина": "Берлін",
    "Іспанія": "Мадрид"
}

user_country = input("Введіть назву країни: ")

capital = countries_capitals.get(user_country, "Нажаль, інформація про таку країну відсутня.")
print(capital)

# Завершіть кожне завдання, використовуючи вбудовані методи для списків, кортежів та словників. Бажаю успіхів у виконанні цих завдань!